Revit 2027 API
FabricationConfiguration.GetFabricationConnectorName Method
 Gets the fabrication connector name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetFabricationConnectorName(
	int fabricationConnectorId
)
Public Function GetFabricationConnectorName (
	fabricationConnectorId As Integer
) As String
public:
String^ GetFabricationConnectorName(
	int fabricationConnectorId
)
member GetFabricationConnectorName :
        fabricationConnectorId : int -> string
Parameters
fabricationConnectorId Int32
 The fabrication connector identifier.
Return Value
String
 The fabrication connector's name.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace